{Вычислить сумму чисел от 1 до n.}
program Summa;
var i, sum, n: integer;
begin
  write('Введите n: ');
  readln(n);
  sum := 0;
  //1. инициализация: i := 1
  //2. если i <= 10, то переходим к 3., если нет, то выходим из цикла
  //3. тело цикла
  //4. инкремент: i := i + 1
  //5. повторяем пункт 2.
  for i := 1 to n do
  begin
    sum := i + sum;
  end;
  writeln(sum);
  {
  sum_n = (a1 + an) * n / 2;
  
  1 2 3 4 5 6 7 8 9 10
  1 + 10 = 11
  2 + 9 = 11
  3 + 8 = 11
  4 + 7 = 11
  5 + 6 = 11
  11 * 5 = 55
  
  sum_n = (a1 + an) / 2 * n ;
  
  1 2 3 4 5 6 7 8 9
  1 + 9 = 10 = 5 * 2
  2 + 8 = 10 = 5 * 2
  3 + 7 = 10 = 5 * 2
  4 + 6 = 10 = 5 * 2
  5 = 10 / 2
  5 * 9 = 45
  }
end.